{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "LlamaEncoderModel",
    "parent_library": "llama_encoder_model.modeling_llama_encoder"
  },
  "base_model_name_or_path": "meta-llama/Meta-Llama-3-8B-Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "gate_proj",
    "down_proj",
    "up_proj",
    "q_proj",
    "o_proj",
    "v_proj"
  ],
  "task_type": null,
  "use_rslora": false
}